<h3>Getting Started With Pandas</h3>

In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

2.2.2

<h3>Series</h3>

In [8]:
#Creating series in pandas using list
lst = [42, 54, 12, 32, 45, 65]
ser = pd.Series(lst)
print(lst)

[42, 54, 12, 32, 45, 65]

In [4]:
#Printing type of series
print(type(ser))

<class 'pandas.core.series.Series'>

In [12]:
#Defining the type of list using dtype()
ser = pd.Series(lst, dtype = "float") 
print(ser)

0    42.0
1    54.0
2    12.0
3    32.0
4    45.0
5    65.0
dtype: float64

In [6]:
#Creating series using ductionary
dict1 = {"name":["Python", "C++", "Java", "HTML"], "popularity":[10, 6, 8, 9], "ranking":[1, 3, 2, 4]}
ser = pd.Series(dict1)
print(ser)

name          [Python, C++, Java, HTML]
popularity                [10, 6, 8, 9]
ranking                    [1, 3, 2, 4]
dtype: object

In [7]:
#Creating series with a repeating value
ser1 = pd.Series(12, index = [1,2,3,4,5,6,7])
ser2 = pd.Series(12, index = [1,2,3,4])
print(ser1 + ser2)

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
7     NaN
dtype: float64

<h3>DataFrame</h3>

In [9]:
#Creating dataframe using list
lst = [42, 54, 12, 32, 45, 65]
dF = pd.DataFrame(lst)
print(dF)

    0
0  42
1  54
2  12
3  32
4  45
5  65

In [10]:
#Printing type of dataframe
print(type(dF))

<class 'pandas.core.frame.DataFrame'>

In [11]:
#Creating dataframe using dictionary
dict1 = {"name":["Python", "C++", "Java", "HTML"], "popularity":[10, 6, 8, 9], "ranking":[1, 3, 2, 4]}
dF = pd.DataFrame(dict1)
print(dF)

     name  popularity  ranking
0  Python          10        1
1     C++           6        3
2    Java           8        2
3    HTML           9        4

In [13]:
#Accessing only specific columns
dict1 = {"name":["Python", "C++", "Java", "HTML"], "popularity":[10, 6, 8, 9], "ranking":[1, 3, 2, 4]}
dF = pd.DataFrame(dict1, columns=["name", "ranking"])
print(dF)

     name  ranking
0  Python        1
1     C++        3
2    Java        2
3    HTML        4

In [14]:
#Printing specific value using indexing
print(dF["name"][2])

Java

<h5>Operations on DataFrame</h5>

In [16]:
#Creating dataframe with multiple series
ser = {"ser1":pd.Series([1,2,3,4,5]), "ser2":pd.Series([11,12,13,14,15])}
dF = pd.DataFrame(ser)
print(dF)

   ser1  ser2
0     1    11
1     2    12
2     3    13
3     4    14
4     5    15

In [17]:
#Adding new column that contains sum of the pervious 2
dF["sum"] = dF["ser1"] + dF["ser2"]
print(dF)

   ser1  ser2  sum
0     1    11   12
1     2    12   14
2     3    13   16
3     4    14   18
4     5    15   20

In [19]:
#Add new column that contains subtraction of the pervious 2
ser = {"ser1":pd.Series([6,2,5,7,8]), "ser2":pd.Series([1,2,3,4,5])}
dF["Sub"] = dF["ser1"] - dF["ser2"]
print(dF)

   ser1  ser2  Sub
0     6     1    5
1     2     2    0
2     5     3    2
3     7     4    3
4     8     5    3

In [23]:
#Add new column that contain multiplication of the pervious 2
dF["Mul"] = dF["ser1"] * dF["ser2"]
print(dF)

   ser1  ser2  Sub  Mul
0     6     1    5    6
1     2     2    0    4
2     5     3    2   15
3     7     4    3   28
4     8     5    3   40

In [24]:
#Add new column that contain division of the pervious 2
dF["divide"] = dF["ser1"] / dF["ser2"]
print(dF)

   ser1  ser2  Sub  Mul    divide
0     6     1    5    6  6.000000
1     2     2    0    4  1.000000
2     5     3    2   15  1.666667
3     7     4    3   28  1.750000
4     8     5    3   40  1.600000

In [25]:
#Adding new column name python which gives true when value in series 1 is greater than or equal to 34
ser = {"ser1":pd.Series([15,53,23,34,10,80]), "ser2":pd.Series([2,4,6,9,10,23])}
dF = pd.DataFrame(ser)
dF["Python"] = dF["ser1"] >= 34
print(dF)

   ser1  ser2  Python
0    15     2   False
1    53     4    True
2    23     6   False
3    34     9    True
4    10    10   False
5    80    23    True

<h5>Insert and Delete Operation on DataFrame</h5>

In [26]:
ser = {"ser1":pd.Series([15,53,23,34,10,80]), "ser2":pd.Series([2,4,6,9,10,23])}
dF = pd.DataFrame(ser)
print(dF)

   ser1  ser2
0    15     2
1    53     4
2    23     6
3    34     9
4    10    10
5    80    23

In [32]:
ser3 = pd.Series([21,45,26,78,42,55])
dF.insert(2,"newSer", ser3)
print(dF)

   ser1  ser2  newSer  ser3
0    15     2      21    21
1    53     4      45    45
2    23     6      26    26
3    34     9      78    78
4    10    10      42    42
5    80    23      55    55

In [34]:
dF["ser4"] = dF["ser3"][:4]
print(dF)

   ser1  ser2  newSer  ser3  ser4
0    15     2      21    21  21.0
1    53     4      45    45  45.0
2    23     6      26    26  26.0
3    34     9      78    78  78.0
4    10    10      42    42   NaN
5    80    23      55    55   NaN

In [35]:
dF.pop("ser4")
print(dF)

   ser1  ser2  newSer  ser3
0    15     2      21    21
1    53     4      45    45
2    23     6      26    26
3    34     9      78    78
4    10    10      42    42
5    80    23      55    55

In [36]:
del dF["newSer"]
print(dF)

   ser1  ser2  ser3
0    15     2    21
1    53     4    45
2    23     6    26
3    34     9    78
4    10    10    42
5    80    23    55

<h3>Writing CSV</h3>

In [2]:
# Creating a dictionary with keys as column names and values as lists of data
dict1 = {
    "Countries": ["France", "NYC", "Japan", "Turkey"],        # List of countries or cities
    "Postal Code": [75000, 10001, 1000001, 34000],            # List of corresponding postal codes
    "Continent": ["Europe", "North America", "Asia", "Asia"]  # List of corresponding continents
}

# Creating a DataFrame from the dictionary
dF = pd.DataFrame(dict1)

# Converting the DataFrame into a CSV file and saving it
# 'index=False' is used to prevent writing row numbers (index) to the CSV file
dF.to_csv("countries.csv", index=False)

# Printing the DataFrame to the console
print(dF)

  Countries  Postal Code      Continent
0    France        75000         Europe
1       NYC        10001  North America
2     Japan      1000001           Asia
3    Turkey        34000           Asia

<h3>Read CSV</h3>

In [6]:
# Specifying the path to the CSV file
path = "C:\\Users\\BSCS\\Desktop\\Pandas\\Pandas\\SoftwareEngineerSalaries.csv"

# Reading the CSV file into a DataFrame
csvFile = pd.read_csv(path)

# Displaying the contents of the DataFrame
csvFile

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,"Garmin International, Inc.",3.9,C# Software Engineer,"Cary, NC",2d,$95K - $118K (Glassdoor est.)
3,Snapchat,3.5,"Software Engineer, Fullstack, 1+ Years of Expe...","Los Angeles, CA",2d,$97K - $145K (Employer est.)
4,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
...,...,...,...,...,...,...
865,RXO,NaN,"Software Engineer, Machine Learning Compute","San Francisco, CA",6d,NaN
866,Infosys,NaN,Software Engineer - 3 (Apache NiFi),"Annapolis Junction, MD",18d,NaN
867,Medtronic,NaN,Senior Software Engineer,"Southfield, MI",19d,NaN
868,NaN,NaN,Junior Python Developer,"Charlotte, NC",2d,NaN
869,NaN,NaN,GUI Software Engineer II - Surgical Robotics,"Boston, MA",10d,NaN

In [8]:
# Reading only the first 3 rows of the CSV file into a DataFrame
csvFile = pd.read_csv(path, nrows=3)

# Displaying the contents of the DataFrame
csvFile

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,"Garmin International, Inc.",3.9,C# Software Engineer,"Cary, NC",2d,$95K - $118K (Glassdoor est.)

In [10]:
# Reading only the "Company" and "Location" columns from the CSV file into a DataFrame
csvFile = pd.read_csv(path, usecols=["Company", "Location"])

# Displaying the contents of the DataFrame
csvFile

                           Company                Location
0                         ViewSoft            Manassas, VA
1                          Workiva                  Remote
2       Garmin International, Inc.                Cary, NC
3                         Snapchat         Los Angeles, CA
4    Vitesco Technologies Group AG              Seguin, TX
..                             ...                     ...
865                            RXO       San Francisco, CA
866                        Infosys  Annapolis Junction, MD
867                      Medtronic          Southfield, MI
868                            NaN           Charlotte, NC
869                            NaN              Boston, MA

[870 rows x 2 columns]

In [12]:
# Reading the CSV file while skipping the fourth row (index 3)
csvFile = pd.read_csv(path, skiprows=[3])

# Displaying the contents of the DataFrame
csvFile

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,Snapchat,3.5,"Software Engineer, Fullstack, 1+ Years of Expe...","Los Angeles, CA",2d,$97K - $145K (Employer est.)
3,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)
...,...,...,...,...,...,...
864,RXO,NaN,"Software Engineer, Machine Learning Compute","San Francisco, CA",6d,NaN
865,Infosys,NaN,Software Engineer - 3 (Apache NiFi),"Annapolis Junction, MD",18d,NaN
866,Medtronic,NaN,Senior Software Engineer,"Southfield, MI",19d,NaN
867,NaN,NaN,Junior Python Developer,"Charlotte, NC",2d,NaN
868,NaN,NaN,GUI Software Engineer II - Surgical Robotics,"Boston, MA",10d,NaN

<h3>CSV File Functions</h3>

In [14]:
# Displaying the index (row labels) of the DataFrame
csvFile.index

RangeIndex(start=0, stop=869, step=1)

In [18]:
# Displaying the column labels (names) of the DataFrame
csvFile.columns

Index(['Company', 'Company Score', 'Job Title', 'Location', 'Date', 'Salary'], dtype='object')

In [19]:
# Generating descriptive statistics of the numerical columns
csvFile.describe()

       Company Score
count     788.000000
mean        3.895305
std         0.525285
min         1.000000
25%         3.600000
50%         3.900000
75%         4.200000
max         5.000000

In [23]:
# Displaying the first 5 rows of the DataFrame as the default value is 5
csvFile.head()

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,Snapchat,3.5,"Software Engineer, Fullstack, 1+ Years of Expe...","Los Angeles, CA",2d,$97K - $145K (Employer est.)
3,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)

In [24]:
# Displaying the first 10 rows of the DataFrame
csvFile.head(10)

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,Snapchat,3.5,"Software Engineer, Fullstack, 1+ Years of Expe...","Los Angeles, CA",2d,$97K - $145K (Employer est.)
3,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)
5,Infor,4.0,Associate Software Engineer,"Alpharetta, GA",7d,$77K - $94K (Glassdoor est.)
6,Amerisoft Corporation,5.0,Software Developers,"Farmington Hills, MI",30d+,$71K - $100K (Glassdoor est.)
7,WHOOP,3.3,"Software Engineer II (Backend, Health)","Boston, MA",10d,$94K - $148K (Glassdoor est.)
8,PFF,4.2,Sr. Software Engineer,Remote,1d,$147K - $189K (Employer est.)
9,Salesforce,4.1,MTS Software Engineer,"San Francisco, CA",5d,$90K - $113K (Employer est.)

In [26]:
# Displaying the last 5 rows of the DataFrame
csvFile.tail()

,Company,Company Score,Job Title,Location,Date,Salary
864,RXO,NaN,"Software Engineer, Machine Learning Compute","San Francisco, CA",6d,NaN
865,Infosys,NaN,Software Engineer - 3 (Apache NiFi),"Annapolis Junction, MD",18d,NaN
866,Medtronic,NaN,Senior Software Engineer,"Southfield, MI",19d,NaN
867,NaN,NaN,Junior Python Developer,"Charlotte, NC",2d,NaN
868,NaN,NaN,GUI Software Engineer II - Surgical Robotics,"Boston, MA",10d,NaN

In [28]:
# Displaying rows 10 through 19 of the DataFrame
csvFile[10:20]

,Company,Company Score,Job Title,Location,Date,Salary
10,"HealthMine Services, Inc.",3.8,Software Engineer,Remote,1d,$54K - $79K (Glassdoor est.)
11,Honeywell,4.1,Software Engineer I,"Aguadilla, PR",2d,$91K - $135K (Glassdoor est.)
12,Legrand AV,3.7,Software Engineer,Minneapolis-Saint Paul,2d,$70K - $135K (Employer est.)
13,Athenahealth,4.0,"Software Engineer, athenaCollector – RCM Rules","Boston, MA",2d,$192K - $288K (Employer est.)
14,Amex,4.1,Java Engineer,"Plantation, FL",6d,$100K - $125K (Employer est.)
15,SOFT LABS NA,5.0,Entry Level to Senior Level Software Developers,"Northborough, MA",30d+,$85K - $127K (Glassdoor est.)
16,Snapchat,3.5,"Software Engineer, C++","Los Angeles, CA",2d,$69K - $109K (Glassdoor est.)
17,Hertz,3.2,Software Engineer,"Seattle, WA",2d,$124K - $234K (Employer est.)
18,Megaport,3.4,Frontend Software Engineer,NaN,2d,$84K - $133K (Glassdoor est.)
19,"7-Eleven, Inc.",3.4,Software Engineer,"Irving, TX",1d,$85K - $150K (Employer est.)

In [31]:
# Converting the DataFrame to a NumPy array
csvFile.to_numpy()

array([['ViewSoft', 4.8, 'Software Engineer', 'Manassas, VA', '8d',
        '$68K - $94K\xa0(Glassdoor est.)'],
       ['Workiva', 4.3, 'Software Support Engineer', 'Remote', '2d',
        '$61K - $104K\xa0(Employer est.)'],
       ['Snapchat', 3.5, 'ML Engineer', 'Los Angeles, CA', '2d',
        '$97K - $145K\xa0(Employer est.)'],
       ...,
       ['Medtronic', nan, 'Senior Software Engineer', 'Southfield, MI',
        '19d', nan],
       [nan, nan, 'Junior Python Developer', 'Charlotte, NC', '2d', nan],
       [nan, nan, 'GUI Software Engineer II - Surgical Robotics',
        'Boston, MA', '10d', nan]], dtype=object)

In [32]:
# Updating the value in the "Job Title" column at index 2
# But this is not the right way to do this.
csvFile["Job Title"][2] = "ML Engineer"
csvFile

C:\Users\BSCS\AppData\Local\Temp\ipykernel_5592\2644753645.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  csvFile["Job Title"][2] = "ML Engineer"
C:\Users\BSCS\AppData\Local\Temp\ipykernel_5592\2644753645.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  csvFile["Job Title"][2] = "ML Engineer"

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,Snapchat,3.5,ML Engineer,"Los Angeles, CA",2d,$97K - $145K (Employer est.)
3,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)
...,...,...,...,...,...,...
864,RXO,NaN,"Software Engineer, Machine Learning Compute","San Francisco, CA",6d,NaN
865,Infosys,NaN,Software Engineer - 3 (Apache NiFi),"Annapolis Junction, MD",18d,NaN
866,Medtronic,NaN,Senior Software Engineer,"Southfield, MI",19d,NaN
867,NaN,NaN,Junior Python Developer,"Charlotte, NC",2d,NaN
868,NaN,NaN,GUI Software Engineer II - Surgical Robotics,"Boston, MA",10d,NaN

In [34]:
# Updating the value in the "Job Title" column at index 864
csvFile.loc[864, "Job Title"] = "Data Scientist"

# Displaying the updated DataFrame
csvFile

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,Snapchat,3.5,ML Engineer,"Los Angeles, CA",2d,$97K - $145K (Employer est.)
3,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)
...,...,...,...,...,...,...
864,RXO,NaN,Data Scientist,"San Francisco, CA",6d,NaN
865,Infosys,NaN,Software Engineer - 3 (Apache NiFi),"Annapolis Junction, MD",18d,NaN
866,Medtronic,NaN,Senior Software Engineer,"Southfield, MI",19d,NaN
867,NaN,NaN,Junior Python Developer,"Charlotte, NC",2d,NaN
868,NaN,NaN,GUI Software Engineer II - Surgical Robotics,"Boston, MA",10d,NaN

In [40]:
# Selecting only the "Company" and "Job Title" columns from the DataFrame
csvFile.loc[:, ["Company", "Job Title"]]

,Company,Job Title
0,ViewSoft,Software Engineer
1,Workiva,Software Support Engineer
2,Snapchat,ML Engineer
3,Vitesco Technologies Group AG,Software Engineer
4,Spotify,Backend Engineer II
...,...,...
864,RXO,Data Scientist
865,Infosys,Software Engineer - 3 (Apache NiFi)
866,Medtronic,Senior Software Engineer
867,NaN,Junior Python Developer
868,NaN,GUI Software Engineer II - Surgical Robotics

In [41]:
# Selecting rows from index 1 to 5 (inclusive) and all columns
csvFile.loc[1:5, :]

,Company,Company Score,Job Title,Location,Date,Salary
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,Snapchat,3.5,ML Engineer,"Los Angeles, CA",2d,$97K - $145K (Employer est.)
3,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)
5,Infor,4.0,Associate Software Engineer,"Alpharetta, GA",7d,$77K - $94K (Glassdoor est.)

In [43]:
# Selecting the value at row index 4 and column index 5 using integer-location based indexing
csvFile.iloc[4, 5]

'$123K - $175K\xa0(Employer est.)'

In [45]:
# Dropping the row at index 3 from the DataFrame (axis=0 specifies row axis)
csvFile.drop(3, axis=0)

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,Snapchat,3.5,ML Engineer,"Los Angeles, CA",2d,$97K - $145K (Employer est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)
5,Infor,4.0,Associate Software Engineer,"Alpharetta, GA",7d,$77K - $94K (Glassdoor est.)
...,...,...,...,...,...,...
864,RXO,NaN,Data Scientist,"San Francisco, CA",6d,NaN
865,Infosys,NaN,Software Engineer - 3 (Apache NiFi),"Annapolis Junction, MD",18d,NaN
866,Medtronic,NaN,Senior Software Engineer,"Southfield, MI",19d,NaN
867,NaN,NaN,Junior Python Developer,"Charlotte, NC",2d,NaN
868,NaN,NaN,GUI Software Engineer II - Surgical Robotics,"Boston, MA",10d,NaN

In [47]:
# Dropping the column named "Date" from the DataFrame (axis=1 specifies column axis)
csvFile.drop("Date", axis=1)

,Company,Company Score,Job Title,Location,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,$61K - $104K (Employer est.)
2,Snapchat,3.5,ML Engineer,"Los Angeles, CA",$97K - $145K (Employer est.)
3,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",$85K - $108K (Glassdoor est.)
4,Spotify,3.9,Backend Engineer II,"New York, NY",$123K - $175K (Employer est.)
...,...,...,...,...,...
864,RXO,NaN,Data Scientist,"San Francisco, CA",NaN
865,Infosys,NaN,Software Engineer - 3 (Apache NiFi),"Annapolis Junction, MD",NaN
866,Medtronic,NaN,Senior Software Engineer,"Southfield, MI",NaN
867,NaN,NaN,Junior Python Developer,"Charlotte, NC",NaN
868,NaN,NaN,GUI Software Engineer II - Surgical Robotics,"Boston, MA",NaN